---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ImportInstanceCuttingInView
source: html/d152cd8b-528e-374a-5eb4-fd62eed1c519.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ImportInstanceCuttingInView Property

"Enable Cutting in Views"

## Syntax (C#)
```csharp
public static ForgeTypeId ImportInstanceCuttingInView { get; }
```